"""
Урок 4. Компоненты. Принципы связности и сочетаемости компонентов

Покупка онлайн билетов на автобус в час пик.

Разделиться на две группы (опционально):

1 Группа: Мобильное приложение и Сервис покупки билета.
2 Группа: Сервис покупки билета и Автобусный парк.

5,6,7,8,10 - берем если группа справляется с заданиями

Предусловия.
Постусловия.
Инвариант.
Определить абстрактные и конкретные классы.
Определить интерфейсы.
Реализовать наследование.
Выявить компоненты.
Разработать Диаграмму компонент использую нотацию UML 2.0. Общая без деталей. (здесь можно просто схематично, как видят студенты)
Определить алгоритм взаимодействия Группы 1 и Группы 2 – разработать контракт.
Посчитать Метрики абстрактности компонент.
Присвоить компонентам версию по принципу SemVer.

Метрика абстрактности компонента = (количество интерфейсов и абстрактных классов) / (общее число классов)

0 — полное отсутствие абстрактных классов в компоненте.
1 — компонент содержит только абстрактные классы.
"""
